clear;clc

% 从excel中读取数据
A = xlsread('C:\Users\Administrator\Desktop\承建商及市场信息.xlsx','元数据','D4:O33');

% 从excel中读取数据
Ni = xlsread('C:\Users\Administrator\Desktop\承建商及市场信息.xlsx','元数据','C4:C33');
Nj = xlsread('C:\Users\Administrator\Desktop\承建商及市场信息.xlsx','元数据','D2:O2')';
% 建立约束
c_mobiao = reshape(A,360,1);



% 构造GC所能成熟装修最大数量的矩阵
a1(30,360) = 0;
for i = 1:30
    for j = i:30:360
        a1(i,j) = 1;
    end
end
a1q = Ni;


%构造GC在Market说能装修的最大数量的约束



cc(63,360) =0; 
 cc(1,28)= 1;%北京

 cc(2,30*1+27)=1;%天津
 cc(3,30*1+28)=1;
 cc(4,30*1+29)=1;



 cc(5,30*2+5)=1;%辽宁
cc(6,30*2+11)=1; 
cc(7,30*2+14)=1;
cc(8,30*2+21)=1;

 cc(9,30*3+5)=1;% 江苏
 cc(10,30*3+10)=1;
cc(11,30*3+11)=1;
cc(12,30*3+14)=1; 
cc(13,30*3+16)=1; 
cc(14,30*3+23)=1;
cc(15,30*3+28)=1;
cc(16,30*3+29)=1;

cc(17,30*4+2)=1;% 上海
cc(18,30*4+5)=1;
cc(19,30*4+15)=1;
cc(20,30*4+23)=1;
cc(21,30*4+25)=1;
cc(22,30*4+26)=1;
cc(23,30*4+28)=1;
cc(24,30*4+29)=1;


cc(25,30*5+2)=1;%浙江
cc(26,30*5+7)=1;
cc(27,30*5+15)=1;
cc(28,30*5+17)=1;
cc(29,30*5+29)=1;


cc(30,30*6+2)=1;%湖北
cc(31,30*6+5)=1;
cc(32,30*6+10)=1;
cc(33,30*6+11)=1;
cc(34,30*6+15)=1;

%四川
cc(35,30*7+3)=1;
cc(36,30*7+10)=1;
cc(37,30*7+14)=1;
cc(38,30*7+15)=1;
cc(39,30*7+20)=1;
cc(40,30*7+26)=1;
cc(41,30*7+30)=1;

%福建
cc(42,30*8+8)=1;
cc(43,30*8+9)=1;
cc(44,30*8+10)=1;
cc(45,30*8+14)=1;
cc(46,30*8+17)=1;
cc(47,30*8+23)=1;
cc(48,30*8+26)=1;
cc(49,30*8+30)=1;

%广州
cc(50,30*9+1)=1;
cc(51,30*9+14)=1;
cc(52,30*9+24)=1;
cc(53,30*9+29)=1;
cc(54,30*9+30)=1;

%深圳
cc(55,30*10+14)=1;
cc(56,30*10+26)=1;
cc(57,30*10+29)=1;
cc(58,30*10+30)=1;

%广贵
cc(59,30*11+1)=1;
cc(60,30*11+3)=1;
cc(61,30*11+4)=1;
cc(62,30*11+14)=1;
cc(63,30*11+27)=1;
c=ones(size(cc,1),1);
a = [a1;cc];
b = [a1q;c];



% 构造Market 所需要的装修数量
aeq(12,360)=0;
for i = 1:12
    for j = (i-1)*30+1:i*30
        aeq(i,j) = 1;
    end
end
beq =Nj;

x = linprog(-c_mobiao, a,b,aeq,beq,zeros(360,1));
value = c_mobiao'*x;

xx=reshape(x,30,12);
xlswrite('C:\Users\Administrator\Desktop\承建商及市场信息_result.xlsx',xx)